OMD_EXCH/Catalogs/ОДМ_БазыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОДМ_БазыДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>TODO: подвязаться к RAS</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Comment>TODO: временный реквизит</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>TODO: временный реквизит</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонфигурации</Name>
					<Comment>TODO: в справочник?</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Comment>TODO: временный реквизит</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТехническиеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаПодключения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сервер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяБазы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Разрешения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сервис</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Доступность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Метаданные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КешироватьЗначения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрироватьВУзлеОбмена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыгружатьПриЗаписи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

OMD_EXCH/CommonModules/ОДМ_ПодпискиНаСобытия/Ext/Module.bsl
#Область ОбработчикиСобытий

// Процедура: ОДМ_СправочникиОбменПередЗаписью
// Назначение: Обрабатывает событие перед записью элемента справочника, создавая задачу обмена.
// Входные параметры:
//   Источник - СправочникСсылка - Ссылка на объект, который записывается.
//   Отказ - Булево - Флаг, указывающий на отказ от записи.
Процедура ОДМ_СправочникиОбменПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОДМ_ПропуститьОбработку(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	//ОДМ_ОбменДанными.СоздатьЗадачуОбмена(Источник, Отказ);
	
КонецПроцедуры

Процедура ОДМ_ОбъектПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	#Если Сервер и Не Сервер Тогда
		Источник = Документы.ОДМ_ХТТПЗапросы.СоздатьДокумент();
		Источник = Справочники.ОДМ_БазыДанных.СоздатьЭлемент();
	#КонецЕсли
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОДМ_ПропуститьОбработку(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеИмя = Источник.Метаданные().ПолноеИмя();
	
	МестаИспользования = ОДМ_ОбменДанными_ПовтИсп.ПолучитьНастройкиОбменаДляТипаОбъекта(МетаданныеИмя);
	
	Для Каждого МестоИспользования Из МестаИспользования Цикл
		
		Если МестоИспользования.РегистрироватьВУзлеОбмена Тогда
			Источник.ОбменДанными.Получатели.Добавить(МестоИспользования.УзелОбмена);
		КонецЕсли;
		
		//FIXME: пока так :(
		ОписаниеИсточника = ОДМ_ОбменДанными_Переопределяемый.СформироватьОписание(Источник, МестоИспользования.База);
		Если ОписаниеИсточника = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		//TODO: кэш нужен, минимум для НСИ что бы не гонять объекты
		Если МестоИспользования.КешироватьЗначения Тогда
		//	СтрокаНабора = НаборЗаписей.Добавить();
		//	СтрокаНабора.Ссылка = Источник.Ссылка;
		//	СтрокаНабора.НастройкаОбмена = МестоИспользования.НастройкаОбмена;
		//	СтрокаНабора.ДатаРегистрации = ТекущаяДата();
		КонецЕсли;
		
		Если МестоИспользования.ВыгружатьПриЗаписи Тогда
			
			ОтправляемыйПакет = ОДМ_ОбменДанными.Конструктор_ОписаниеПакетаЗаписиОбъекта();
			ОтправляемыйПакет.ОчищатьТабличнуюЧасть = ОДМ_ОбменДанными.УстановитьСвойство("Булево", Истина);
			ОтправляемыйПакет.ВключитьОбменДанными = ОДМ_ОбменДанными.УстановитьСвойство("Булево", Истина);
			ОтправляемыйПакет.Данные = ОписаниеИсточника;
			
			ВнешнийИнтерфейс = ОДМ_ОбменДанными.Конструктор_ВнешнийИнтерфейс();
			
			//FIXME Отправка в базу в зависимости от Организации в документах
			Если МетаданныеИмя = "Документ.ПоступлениеНаРасчетныйСчет" ИЛИ МетаданныеИмя = "Документ.СписаниеСРасчетногоСчета" Тогда
				
				ОтправляемыйПакет.ВключитьОбменДанными = Ложь;
				
				Если Источник.Проведен Тогда
					ОтправляемыйПакет.Проводить = ОДМ_ОбменДанными.УстановитьСвойство("Булево", Истина);
				КонецЕсли;
				
				ИННОрганизацииОтправки = Источник.Организация.ИНН;
				БазаОтправки = ПЛ_ОбменElma.ВернутьДополнительнуюКонстанту("БазаБПИНН-" + ИННОрганизацииОтправки);
				Если НЕ ЗначениеЗаполнено(БазаОтправки) Тогда
					Продолжить;
				КонецЕсли;
				ВнешнийИнтерфейс.ЗаполнитьПараметрыПодключения(БазаОтправки);
			Иначе
				ВнешнийИнтерфейс.ЗаполнитьПараметрыПодключения(МестоИспользования.База);
			КонецЕсли;
			
			
			Асинхронно = Ложь;
			РезультатМетода = ВнешнийИнтерфейс.ОтправитьОбъектНаСервер(ОтправляемыйПакет, Асинхронно);
			
			//тут можно записать в регистр соответсвий. с пометкой заплятка
			//.....
			
			//ВыгрузитьДанныеОбъекта(Источник);
			//если выгрузилось, тогда снять из плана обмена
		КонецЕсли;
		
	КонецЦикла;
		
	//Если НаборЗаписей.Количество() > 0 Тогда
	//	НаборЗаписей.Записать();
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

Функция ОДМ_ПропуститьОбработку(Источник)
	
	ОДМ_ПропуститьОбработку = Ложь;
	
	Если Источник.ДополнительныеСвойства.Свойство("ОДМ_ПропуститьОбработку") Тогда
		ОДМ_ПропуститьОбработку = Источник.ДополнительныеСвойства.ОДМ_ПропуститьОбработку;
	КонецЕсли;
	
	Возврат ОДМ_ПропуститьОбработку;
	
КонецФункции



#КонецОбласти // СлужебныеПроцедурыИФункции
